In [1]:
import pandas as pd 
import numpy as np

In [92]:
df = pd.read_csv('/Users/danialmendigali/jupyter-datascience/Pandas/data set /Titanic-Dataset.csv')

### Block 1(apply)  take a function and apply it to each element

In [5]:
df['age_plus1'] = df['Age'].apply(lambda x: x + 1)

In [7]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,age_plus1
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,23.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,39.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,27.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,36.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,36.0

The history saving thread hit an unexpected error (OperationalError('attempt to write a readonly database')).History will not be written to the database.

In [17]:
def age_group(age):
    if age < 18: 
        return 'child'
    elif age <= 50:
        return 'adult'
    else:
        return 'senior'

df['age_group'] = df['Age'].apply(age_group)
df[['Age', 'age_group']].head(5)

    Age age_group
0  22.0     adult
1  38.0     adult
2  26.0     adult
3  35.0     adult
4  35.0     adult

In [29]:
df['age_group'] = df['Age'].apply(
    lambda x: 'child' if x < 18 else ('adult' if x <= 50 else 'senior') # тернарный оператор 
)

In [27]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,age_group
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,adult
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,adult
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,adult
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,adult
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,adult
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,adult
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,adult
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,senior
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,adult
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,adult

In [32]:
def survival_type(row):
    if row['Survived'] == 1 and row['Fare'] > 50:
        return 'rich_survived'
    elif row['Survived'] == 1:
        return 'poor_survived'
    else :
        return 'not_survived'
df['survival_type'] = df.apply(survival_type, axis=1) ## axis=1 If you use multiple columns at the same time
df[['Survived', 'Fare', 'survival_type']].head(5)

   Survived     Fare  survival_type
0         0   7.2500   not_survived
1         1  71.2833  rich_survived
2         1   7.9250  poor_survived
3         1  53.1000  rich_survived
4         0   8.0500   not_survived

In [43]:
df['survival_type'] = df.apply(
    lambda r: 'rich_survived' if r['Survived'] == 1 and r['Fare'] > 50
    else ('poor_survived' if r['Survived'] == 1 else 'not_survived'),
    axis = 1
)

In [46]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,survival_type
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,not_survived
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,rich_survived
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,poor_survived
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,rich_survived
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,not_survived

In [61]:
def family_size(row):
    return row['SibSp'] + row['Parch'] + 1 

df['family_size'] = df.apply(family_size, axis=1)
df[['SibSp', 'Parch', 'family_size']].head(5)

   SibSp  Parch  family_size
0      1      0            2
1      1      0            2
2      0      0            1
3      1      0            2
4      0      0            1

In [67]:
def avgFare_family(row):   ## an average fare for 1 person from family
    return ((row['Fare']) / (row['Parch'] + row['SibSp'] + 1))

df['avgFare_family'] = df.apply(avgFare_family, axis=1)
df[['Parch', 'SibSp', 'Fare', 'avgFare_family']].head(5)

   Parch  SibSp     Fare  avgFare_family
0      0      1   7.2500         3.62500
1      0      1  71.2833        35.64165
2      0      0   7.9250         7.92500
3      0      1  53.1000        26.55000
4      0      0   8.0500         8.05000

In [68]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,family_size,avgFare_family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,3.62500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,35.64165
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,7.92500
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,26.55000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,8.05000

In [102]:
df['fare_level'] = df.apply(
    lambda x: 'low' if x['Fare'] < 20
    else('medium' if 20 <= x['Fare'] <= 50 else 'high'),
    axis = 1
)

In [103]:
df.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,survived_female,fare_level
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S,0,low
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S,1,medium
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,0,medium
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,0,medium
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,0,low

In [104]:
df['survived_female'] = df.apply(
    lambda x: 1 if x['Sex'] == 'female' and x['Survived'] == 1
    else 0,
    axis=1
)
df[['Survived', 'Sex', 'survived_female']]

     Survived     Sex  survived_female
0           0    male                0
1           1  female                1
2           1  female                1
3           1  female                1
4           0    male                0
..        ...     ...              ...
886         0    male                0
887         1  female                1
888         0  female                0
889         1    male                0
890         0    male                0

[891 rows x 3 columns]

In [106]:
df['survived_female'] = np.where(
     (df['Sex'] == 'female') & (df['Survived'] == 1), 1, 0
)
df[['Survived', 'Sex', 'survived_female']]

     Survived     Sex  survived_female
0           0    male                0
1           1  female                1
2           1  female                1
3           1  female                1
4           0    male                0
..        ...     ...              ...
886         0    male                0
887         1  female                1
888         0  female                0
889         1    male                0
890         0    male                0

[891 rows x 3 columns]

In [112]:
df['priority'] = np.where(
    (df['Sex'] == 'female') | (df['Age'] < 16), 1, 0
)
df[['Sex', 'Age', 'priority']].head(10)

      Sex   Age  priority
0    male  22.0         0
1  female  38.0         1
2  female  26.0         1
3  female  35.0         1
4    male  35.0         0
5    male   NaN         0
6    male  54.0         0
7    male   2.0         1
8  female  27.0         1
9  female  14.0         1

In [141]:
df1 = pd.read_csv('/Users/danialmendigali/jupyter-datascience/Pandas/data set /insurance.csv')

In [140]:
def charges_level(row):
    if row['charges'] < 3000:
        return 'low'
    elif row['charges'] > 3000 and row['charges'] < 10000:
        return 'medium'
    else:
        return 'high'

df1['charges_level'] = df1.apply(charges_level, axis=1)
df1.head(5)

,age,sex,bmi,children,smoker,region,charges,charges_level,risk_level
0,19,female,27.900,0,yes,southwest,16884.92400,high,medium
1,18,male,33.770,1,no,southeast,1725.55230,low,low
2,28,male,33.000,3,no,southeast,4449.46200,medium,low
3,33,male,22.705,0,no,northwest,21984.47061,high,low
4,32,male,28.880,0,no,northwest,3866.85520,medium,low

In [120]:
df1['bmi'].max()

np.float64(53.13)

In [134]:
df1['risk_level'] = df1.apply(
    lambda x: 'low'
    if x['smoker'] == 'no'
    else('medium' if 17 < x['bmi'] < 30 else 'high'),
    axis=1 
)

In [139]:
df1.loc[
    (df1['smoker'] == 'yes')
].head(5)

,age,sex,bmi,children,smoker,region,charges,charges_level,risk_level
0,19,female,27.90,0,yes,southwest,16884.9240,high,medium
11,62,female,26.29,0,yes,southeast,27808.7251,high,medium
14,27,male,42.13,0,yes,southeast,39611.7577,high,high
19,30,male,35.30,0,yes,southwest,36837.4670,high,high
23,34,female,31.92,1,yes,northeast,37701.8768,high,high

In [142]:
df1.tail(5)

      age     sex    bmi  children smoker     region     charges
1333   50    male  30.97         3     no  northwest  10600.5483
1334   18  female  31.92         0     no  northeast   2205.9808
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

In [148]:
def risk_level(row):
    if row['smoker'] == 'yes' and df1['bmi'].min() < row['bmi'] < 30:
        return 'medium'
    elif row['smoker'] == 'no':
        return 'low'
    else:
        return 'high'

df1['risk_level'] = df1.apply(risk_level, axis=1)
df1[['bmi', 'smoker', 'risk_level']].loc[
    (df1['smoker'] == 'yes')
].head(5)

      bmi smoker risk_level
0   27.90    yes     medium
11  26.29    yes     medium
14  42.13    yes       high
19  35.30    yes       high
23  31.92    yes       high

In [150]:
df1[['bmi', 'smoker', 'risk_level']].tail(5)

        bmi smoker risk_level
1333  30.97     no        low
1334  31.92     no        low
1335  36.85     no        low
1336  25.80     no        low
1337  29.07    yes     medium